Repo with the following:

```
terraform {
  required_providers {
    packetfabric = {
      source  = "PacketFabric/packetfabric"
      version = ">= 0.3.0"
    }
  }
}

provider "packetfabric" {
  host  = var.pf_api_server
  token = var.pf_api_key
}

# Create random name to use to name objects
resource "random_pet" "name" {}

# From the PacketFabric side: Create a cloud router
resource "packetfabric_cloud_router" "cr" {
  provider     = packetfabric
  name         = "${var.tag_name}-${random_pet.name.id}"
  account_uuid = var.pf_account_uuid
  asn          = var.pf_cr_asn
  capacity     = var.pf_cr_capacity
  regions      = var.pf_cr_regions
}

# From the PacketFabric side: Create a cloud router connection to AWS
resource "packetfabric_cloud_router_connection_aws" "crc_1" {
  provider       = packetfabric
  description    = "${var.tag_name}-${random_pet.name.id}-${var.pf_crc_pop1}"
  circuit_id     = packetfabric_cloud_router.cr.id
  account_uuid   = var.pf_account_uuid
  aws_account_id = var.pf_aws_account_id
  pop            = var.pf_crc_pop1
  zone           = var.pf_crc_zone1
  speed          = var.pf_crc_speed
  maybe_nat      = var.pf_crc_maybe_nat
  is_public      = var.pf_crc_is_public
}
resource "packetfabric_cloud_router_connection_aws" "crc_2" {
  provider       = packetfabric
  description    = "${var.tag_name}-${random_pet.name.id}-${var.pf_crc_pop2}"
  circuit_id     = packetfabric_cloud_router.cr.id
  account_uuid   = var.pf_account_uuid
  aws_account_id = var.pf_aws_account_id
  pop            = var.pf_crc_pop2
  zone           = var.pf_crc_zone2
  speed          = var.pf_crc_speed
  maybe_nat      = var.pf_crc_maybe_nat
  is_public      = var.pf_crc_is_public
}
```

First creation (terraform apply):
```
  + create

Terraform will perform the following actions:

  # packetfabric_cloud_router.cr will be created
  + resource "packetfabric_cloud_router" "cr" {
      + account_uuid = "24a0aef3-2784-48dc-9a8e-52d44d6da646"
      + asn          = 4556
      + capacity     = "1Gbps"
      + id           = (known after apply)
      + name         = (known after apply)
      + regions      = [
          + "US",
        ]
    }

  # packetfabric_cloud_router_connection_aws.crc_1 will be created
  + resource "packetfabric_cloud_router_connection_aws" "crc_1" {
      + account_uuid   = "24a0aef3-2784-48dc-9a8e-52d44d6da646"
      + aws_account_id = "687236962849"
      + circuit_id     = (known after apply)
      + description    = (known after apply)
      + id             = (known after apply)
      + is_public      = false
      + maybe_nat      = false
      + pop            = "SFO6"
      + speed          = "50Mbps"
      + zone           = "b"
    }

  # packetfabric_cloud_router_connection_aws.crc_2 will be created
  + resource "packetfabric_cloud_router_connection_aws" "crc_2" {
      + account_uuid   = "24a0aef3-2784-48dc-9a8e-52d44d6da646"
      + aws_account_id = "687236962849"
      + circuit_id     = (known after apply)
      + description    = (known after apply)
      + id             = (known after apply)
      + is_public      = false
      + maybe_nat      = false
      + pop            = "NYC1"
      + speed          = "50Mbps"
      + zone           = "c"
    }

  # random_pet.name will be created
  + resource "random_pet" "name" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
random_pet.name: Creating...
random_pet.name: Creation complete after 0s [id=elegant-grackle]
packetfabric_cloud_router.cr: Creating...
packetfabric_cloud_router.cr: Creation complete after 0s [id=PF-L3-CUST-1747619]
packetfabric_cloud_router_connection_aws.crc_2: Creating...
packetfabric_cloud_router_connection_aws.crc_1: Creating...
packetfabric_cloud_router_connection_aws.crc_2: Creation complete after 8s [id=PF-L3-CON-1747623]
packetfabric_cloud_router_connection_aws.crc_1: Still creating... [10s elapsed]
packetfabric_cloud_router_connection_aws.crc_1: Still creating... [20s elapsed]
packetfabric_cloud_router_connection_aws.crc_1: Creation complete after 24s [id=PF-L3-CON-1747629]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```

2nd run without changing anything (terraform plan only):
```
  ~ update in-place

Terraform will perform the following actions:

  # packetfabric_cloud_router_connection_aws.crc_1 will be updated in-place
  ~ resource "packetfabric_cloud_router_connection_aws" "crc_1" {
        id             = "PF-L3-CON-1747629"
      ~ pop            = "SFO1" -> "SFO6"
        # (8 unchanged attributes hidden)
    }

  # packetfabric_cloud_router_connection_aws.crc_2 will be updated in-place
  ~ resource "packetfabric_cloud_router_connection_aws" "crc_2" {
      ~ description    = "demo-pf-aws-elegant-grackle-SFO6" -> "demo-pf-aws-elegant-grackle-NYC1"
        id             = "PF-L3-CON-1747623"
      ~ pop            = "SFO1" -> "NYC1"
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

I think what might happening is the pop chosen at the creation may end up being a different one. In above example, we used ``SFO6`` and ``NYC1`` which end up showing as:

```
        "cloud_provider": {
            "pop": "SFO6",
            "site": "Coresite SV4"
        },
        "pop": "SFO1",
```

```
        "cloud_provider": {
            "pop": "NYC1",
            "site": "165 Halsey MMR"
        },
        "pop": "NYC1",
```

In @kliu47, he had set pop to ``WDC2`` but it got set to ``WDC1`` in the PF backend.

It is not possible to change the pop after a Cloud Router Connetion is created (only way is to delete/re-create) so maybe we can just modify the terraform provider behavior to not trigger an updated in-place in case the pop changes?